#+title: Notas de Aula - 17 POO: Classes Abstratas e Interfaces
#+author: Luigi D. C. Soares
#+startup: entitiespretty
#+options: toc:nil  num:nil
** Exemplo de Introdução

Um MusicPlayer e um VideoPlayer possuem alguns comportamentos em comum. Quais?

#+begin_src C++ :flags -std=c++17 :exports both :results scalar
#include <iostream>

// Interface
class Playable {
public:
  virtual void play() = 0;
  virtual void pause() = 0;

  // Toda interface deve implementar um destrutor virtual!
  virtual ~Playable() = default;
};

// MusicPlayer *é* Playable
class MusicPlayer : public Playable {
public:
  void play() override {
    std::cout << "Music is playing." << std::endl;
  }

  void pause() override {
    std::cout << "Music playback paused." << std::endl;
  }
};

// VideoPlayer *é* Playable
class VideoPlayer : public Playable {
public:
  void play() override {
    std::cout << "Video is playing." << std::endl;
  }

  void pause() override {
    std::cout << "Video playback paused." << std::endl;
  }
};

void test_playable(Playable &p) {
  p.play();
  p.pause();
}

int main() {
  MusicPlayer mp;
  VideoPlayer vp;
  
  test_playable(mp);
  test_playable(vp);
  
  return 0;
}
#+end_src

#+RESULTS:
: Music is playing.
: Music playback paused.
: Video is playing.
: Video playback paused.

MusicPlayer e VideoPlayer poderiam, também, ter uma função de gravar.
- Faz sentido colocar esta operação em ~Playable~?
- Podemos ter uma classe implementado duas interfaces? Em C++, alcançado por meio de herança múltipla (um caso que faz sentido!)
  
#+begin_src C++ :flags -std=c++17 :exports both :results silent
#include <iostream>

// Interface
class Playable {
public:
  virtual void play() = 0;
  virtual void pause() = 0;

  // Toda interface deve implementar um destrutor virtual!
  virtual ~Playable() = default;
};

// Outra interface
class Recordable {
public:
  virtual void record() = 0;
  virtual ~Recordable() {}
};

// MusicPlayer *é* Playable e Recordable
class MusicPlayer : public Playable, public Recordable {
public:
  void play() override {
    std::cout << "Music is playing." << std::endl;
  }

  void pause() override {
    std::cout << "Music playback paused." << std::endl;
  }
};

// VideoPlayer *é* Playable e Recordable
class VideoPlayer : public Playable, public Recordable {
public:
  void play() override {
    std::cout << "Video is playing." << std::endl;
  }

  void pause() override {
    std::cout << "Video playback paused." << std::endl;
  }
};

void test_playable(Playable &p) {
  p.play();
  p.pause();
}

void test_recordable(Recordable &r) {
  r.record();
}

int main() {
  MusicPlayer mp;
  VideoPlayer vp;
  
  test_recordable(mp);
  test_playable(mp);

  test_recordable(vp);
  test_playable(vp);
  
  return 0;
}
#+end_src

#+begin_example
error: cannot declare variable ‘mp’ to be of abstract type ‘MusicPlayer’
error: cannot declare variable ‘vp’ to be of abstract type ‘VideoPlayer’
#+end_example

Hmm, o que deu errado? Volte ao código para identificar o que esquecemos.

#+begin_src C++ :flags -std=c++17 :exports both :results scalar
#include <iostream>

// Interface
class Playable {
public:
  virtual void play() = 0;
  virtual void pause() = 0;

  // Toda interface deve implementar um destrutor virtual!
  virtual ~Playable() = default;
};

// Outra interface
class Recordable {
public:
  virtual void record() = 0;
  virtual ~Recordable() {}
};

// MusicPlayer *é* Playable e Recordable
class MusicPlayer : public Playable, public Recordable {
public:
  void play() override {
    std::cout << "Music is playing." << std::endl;
  }

  void pause() override {
    std::cout << "Music playback paused." << std::endl;
  }

  void record() override {
    std::cout << "Recording music." << std::endl;
  }
};

// VideoPlayer *é* Playable e Recordable
class VideoPlayer : public Playable, public Recordable {
public:
  void play() override {
    std::cout << "Video is playing." << std::endl;
  }

  void pause() override {
    std::cout << "Video playback paused." << std::endl;
  }

  void record() override {
    std::cout << "Recording video." << std::endl;
  }
};

void test_playable(Playable &p) {
  p.play();
  p.pause();
}

void test_recordable(Recordable &r) {
  r.record();
}

int main() {
  MusicPlayer mp;
  VideoPlayer vp;
  
  test_recordable(mp);
  test_playable(mp);

  test_recordable(vp);
  test_playable(vp);
  
  return 0;
}
#+end_src

#+RESULTS:
: Recording music.
: Music is playing.
: Music playback paused.
: Recording video.
: Video is playing.
: Video playback paused.

